while True:
    try:
        inp = str(input())
        if 'Привіт' in inp:
            print("Доброго вечора, я бот з України!")
        elif "Хай" in inp:
            print("Доброго вечора, я бот з України!")
        elif "Доброго вечора" in inp:
            print("Доброго вечора, я бот з України!")
        else:
            print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")
            feeling = str(input())
            if "Як справи?" in feeling:
                print("Вчусь програмувати на Python!")
            elif "Що робиш?" in feeling:
                print("Вчусь програмувати на Python!")
            elif "Чим займаєшся?" in feeling:
                print ("Вчусь програмувати на Python!")
            else:
                print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")
                film = str(input())
                if "Фільм" in film:
                    print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться фільм Бойцовський клуб, він просто бомба!")
                elif "Кінотеатр" in film:
                    print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться фільм Бойцовський клуб, він просто бомба!")
                elif "Серіал" in film:
                    print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться фільм Бойцовський клуб, він просто бомба!")
                else:
                    print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")
                    bye = str(input())
                    if "Бувай" in bye:
                        print("Побачимось у мережі, I'll be back")
                    elif "Надобраніч" in bye:
                        print("Побачимось у мережі, I'll be back")
                    elif "До зустрічі" in bye:
                        print("Побачимось у мережі, I'll be back")
                    else:
                        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")
                        break
    except Exception:
        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")
        continue
